app/controllers/api/books_controller.rb

  def update
    @book = Book.find(params[:id])

    if @book.update(book_params)
---
SELECT "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
UPDATE "books" SET "title" = $1, "author_id" = $2, "updated_at" = $3 WHERE "books"."id" = $4  [["title", "O programador"], ["author_id", 1], ["updated_at", "2023-11-04 17:53:34.901341"], ["id", 10]]