app/views/parts/_form.html.erb

SELECT "suppliers".* FROM "suppliers"
---
    <%= form.label :supplier_id, style: "display: block" %>
    <%= form.collection_select :supplier_id, Supplier.all, :id, :name %>