app/views/books/_form.html.erb

SELECT "authors".* FROM "authors"
---
    <select id="book_author_id" name="book[author_id]" class="form-select" style="color: white;width: 250px">
      <% Author.all.each do |author| %>

SELECT "assemblies".* FROM "assemblies"
---
    <select id="book_assembly_id" name="book[assembly_id]" class="form-select" style="color: white;width: 250px">
      <% Assembly.all.each do |assembly| %>