app/controllers/accounts_controller.rb

SELECT "suppliers".* FROM "suppliers" WHERE "suppliers"."id" = $1 LIMIT $2  [["id", 14], ["LIMIT", 1]]
---
  def new
    @supplier = Supplier.find(params[:supplier_id])

INSERT INTO "accounts" ("bank", "number", "supplier_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["bank", ""], ["number", ""], ["supplier_id", 15], ["created_at", "2023-10-30 23:52:38.075133"], ["updated_at", "2023-10-30 23:52:38.075133"]]
---
  def create
    # POST /accounts or /accounts.js
    @account = @supplier.build_account(account_params)

    if @account.save

DELETE FROM "accounts" WHERE "accounts"."id" = $1  [["id", 15]]
---
  def destroy
    @account.destroy

SELECT "suppliers".* FROM "suppliers" WHERE "suppliers"."id" = $1 LIMIT $2  [["id", 14], ["LIMIT", 1]]
---
  def set_supplier
    @supplier = Supplier.find(params[:supplier_id])