app/controllers/assemblies_controller.rb

SELECT "assemblies".* FROM "assemblies"
---
  def index
    @assemblies = Assembly.all

INSERT INTO "assemblies" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Capa Dura"], ["created_at", "2023-10-31 00:57:31.510770"], ["updated_at", "2023-10-31 00:57:31.510770"]]
---
  def create
    @assembly = Assembly.new(assembly_params)

    respond_to do |format|
      if @assembly.save

DELETE FROM "assemblies" WHERE "assemblies"."id" = $1  [["id", 2]]
---
  def destroy
    @assembly.destroy

SELECT "assemblies".* FROM "assemblies" WHERE "assemblies"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def set_assembly
      @assembly = Assembly.find(params[:id])