app/controllers/authors_controller.rb

  def create
    @author = Author.new(author_params)

    if @author.save
---
INSERT INTO "authors" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Vcitor"], ["created_at", "2023-10-29 18:51:33.511360"], ["updated_at", "2023-10-29 18:51:33.511360"]]