app/controllers/books_controller.rb

INSERT INTO "books" ("title", "author_id", "created_at", "updated_at", "assembly_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", nil], ["author_id", 1], ["created_at", "2023-10-31 01:06:00.073520"], ["updated_at", "2023-10-31 01:06:00.073520"], ["assembly_id", nil]]
---
  def create
    @book = Book.new(book_params)

    if @book.save