app/controllers/parts_controller.rb

  def index
    @parts = Part.all
---
SELECT "parts".* FROM "parts"

  def create
    @part = Part.new(part_params)

    if @part.save
---
INSERT INTO "parts" ("name", "description", "supplier_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Papel azul"], ["description", "Azul\n"], ["supplier_id", 19], ["created_at", "2023-10-31 01:02:55.747163"], ["updated_at", "2023-10-31 01:02:55.747163"]]

  def set_part
    @part = Part.find(params[:id])
---
SELECT "parts".* FROM "parts" WHERE "parts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]