app/controllers/suppliers_controller.rb

SELECT "accounts".* FROM "accounts" WHERE "accounts"."supplier_id" = $1  [["supplier_id", 5]]
SELECT "suppliers".* FROM "suppliers" WHERE "suppliers"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
  def show
    @supplier = Supplier.includes(:account).find(params[:id])

INSERT INTO "suppliers" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Victor"], ["created_at", "2023-10-30 22:59:33.648057"], ["updated_at", "2023-10-30 22:59:33.648057"]]
---
  def create
    @supplier = Supplier.new(supplier_params)

    if @supplier.save

DELETE FROM "suppliers" WHERE "suppliers"."id" = $1  [["id", 5]]
---
  def destroy
    @supplier.destroy

SELECT "suppliers".* FROM "suppliers" WHERE "suppliers"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def set_supplier
    @supplier = Supplier.find(params[:id])