app/views/assemblies/_form.html.erb

SELECT "parts".* FROM "parts"
---
    <%= form.label :parts_ids, style: "display: block" %>
    <%= collection_check_boxes(:assemblies, :parts_ids, Part.all, :id, :name) %>