app/views/assemblies/show.html.erb

<div>
  <% @assembly.parts.each do |part| %>
---
SELECT "parts".* FROM "parts" INNER JOIN "assemblies_parts" ON "parts"."id" = "assemblies_parts"."part_id" WHERE "assemblies_parts"."assembly_id" = $1  [["assembly_id", 1]]